Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense (Dense)                (None, 32)                96        
_________________________________________________________________
dense_1 (Dense)              (None, 125)               4125      
_________________________________________________________________
dense_2 (Dense)              (None, 125)               15750     
_________________________________________________________________
dense_3 (Dense)              (None, 50)                6300      
_________________________________________________________________
dense_4 (Dense)              (None, 1)                 51        
=================================================================
Total params: 26,322
Trainable params: 26,322
Non-trainable params: 0
_________________________________________________________________
